tutorials/rheoInterFoam/DieSwell/Oldroyd-BLog/0/theta.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
   inlet
    {
       type            fixedValue;
       value           uniform (0 0 0 0 0 0);
    }
    
    outlet
    {
       type            zeroGradient;
    }
    
    wallIn
    {
      type             zeroGradient;
    }
    
    wallOut
    {
       type            zeroGradient;
    }
    
    atmosphere
    {
         type          zeroGradient;
    }
    
    symmetry
    {
       type            symmetryPlane;
    }
}
